/* State and Keywordgroupnames */
"/ERB/Strings in Tags" = "Strings in Tags";
"/ERB/Attributes in Tags" = "Attributes in Tags";
"/ERB/Entities" = "Entities";
"/ERB/Tags" = "Tags";
"/ERB/Comment" = "<!-- Comment -->";
"/ERB/Escape" = "<? Comment ?>";
"/ERB/Inline CSS" = "Inline CSS";
"/ERB/CSS Strings in Tags" = "CSS Strings in Tags";
"/ERB/CSS Attributes in Tags" = "CSS Attributes in Tags";
"/ERB/CSS Begin and End" = "CSS Begin and End";
"/ERB/Inline Javascript" = "Inline Javascript";
"/ERB/JSString" = "Javascript \"String\"";
"/ERB/JSSingleString" = "Javascript 'String'";
"/ERB/JSComment" = "Javascript /* Comment */";
"/ERB/JSSingleComment" = "Javascript // Comment";
"/ERB/Opening Script Tag" = "Javascript Begin and End";

"/ERB/ERB Delimiter" = "<%ERB Delimiter%>";
"/ERB/Ruby" = "Ruby Code";
"/ERB/SGML Double Dash" = "Invalid SGML Comment Warning";
"/ERB/CDATA" = "<![CDATA[...]]>";
"/ERB/Doctype" = "<!Declaration>";
"/ERB/Escape" = "<?Prologue?>";
"/ERB/Style Tags" = "Style Tags";
"/ERB/Opening Style Tag" = "Opening Style Tag";
"/ERB/Inside curly brackets" = "{CSS inside curly brackets}";
"/ERB/CSSComment" = "/* CSS Comment */";
"/ERB/CSSSingleComment" = "// CSS Comment";
"/ERB/CSSRound bracket" = "(CSS inside parenthesis)";
"/ERB/CSSString" = "\"CSS Strings\"";
"/ERB/CSSSingleString" = "'CSS Strings'";
"/ERB/Inline CSS" = "Inline CSS";
"/ERB/Script Tags" = "Script Tags";
"/ERB/Opening Script Tag" = "Opening Script Tag";
"/ERB/JSAutodocComment" = "/*\" Javascript Comment \"*/";
"/ERB/JSComment" = "/* Javascript Comment */";
"/ERB/JSSingleComment" = "// Javascript Comment";
"/ERB/JSRegEx" = "Javascript Regular Expressions";
"/ERB/JSString" = "\"Javascript Strings\"";
"/ERB/JSSingleString" = "'Javascript Strings'";
"/ERB/Inline Javascript" = "Inline Javascript";
"/ERB/Attributes in Tags" = "Attributes in Tags";
"/ERB/Strings in Tags" = "Strings in Tags";
"/ERB/Tags" = "Tags";

"/Ruby/Literals" = "Literals";
"/Ruby/Attribute Definitions" = "Attribute Definitions";
"/Ruby/Definitions" = "Definitions";
"/Ruby/Keywords" = "Keywords";
"/Ruby/Builtin Functions" = "Builtin Functions";
"/Ruby/Builtin Globals" = "Builtin Globals";
"/Ruby/Builtin Classes" = "Builtin Classes";
"/Ruby/Symbols" = ":symbols";
"/Ruby/Numbers" = "Numbers";
"/Ruby/Instance Variables" = "Instance Variables";
"/Ruby/Class Variables" = "Class Variables";
"/Ruby/Global Variables" = "Global Variables";
"/Ruby/String with double quotes" = "\"Strings\"";
"/Ruby/test" = "#{Embedded expressions}";
"/Ruby/String with single quotes" = "'Strings'";
"/Ruby/Backticks" = "`Backticks`";
"/Ruby/Singleline Comment" = "# Comment";
"/Ruby/Regexp" = "Regular expression";
"/Ruby/POD Comments" = "POD Comments";
"/Ruby/HTMLComment" = "<!-- comment -->";
"/Ruby/Heredoc" = ">>HEREDOC String";
"/Ruby/Hexadecimal Characters" = "Hexadecimal Characters";

"/CSS/CSS Attributes" = "CSS Attributes";
"/CSS/CSS Keywords" = "CSS Keywords";
"/CSS/CSS Digits" = "CSS Digits";
"/CSS/CSS Colors" = "CSS Colors";

"/Javascript/Keywords" = "Javascript Keywords";
"/Javascript/Numbers" = "Javascript Numbers";
"/Javascript/Characters" = "Javascript Characters";
"/Javascript/FunctionRegex" = "Javascript Function Calls";
